{
  "homePage": {
    "name": "M.Sadegh Hadipour",
    "occupation": "FrontEnd Developer",
    "summary": "A highly skilled and experienced front-end developer with over 3 years of experience in designing and developing responsive websites and web applications.",
    "phoneNumber": "+989118161416",
    "about": " I am a front-end developer with over 3 years of experience in designing and developing\n                        responsive websites and web applications. Proficient in HTML, CSS, JavaScript, and various\n                        front-end frameworks such as Vue, Angular, and React.\n                        Experienced in agile development methodology, and familiar with version\n                        control tools such as Git. Strong communication and collaboration skills, and able to\n                        work effectively in a team environment.\n                        <br>\n                        <br>\n                        <b>Technical Skills:</b>\n                        <br>\n                        <ul>\n                            <li>Languages: HTML, CSS, JavaScript</li>\n                            <li>Frameworks: Vue, Angular, React, Bootstrap, TailWindCss</li>\n                            <li>Other: Responsive design, cross-browser compatibility, accessibility standards</li>\n                        </ul>\n                        <br>\n                        <br>\n                        <b>Work Experience:</b>\n                        <p class=\"body-2 font-italic\">\n                            Front-End Developer\n                            <br>\n                            Filio Company | Dec 2022 - Oct 2022\n                        </p>\n                        <ul>\n                            <li>Collaborate with designers and back-end developers to create responsive websites and web\n                                applications using Vue, quasar and other front-end technologies.\n                            </li>\n                            <li>Implement designs and user interfaces using HTML, CSS, and JavaScript, while ensuring\n                                cross-browser compatibility and accessibility.\n                            </li>\n                            <li>Develop and maintain code libraries, style guides, and other documentation to ensure\n                                consistency and code reusability.\n                            </li>\n                            <li>Participate in code reviews and provide feedback on coding best practices and\n                                optimization techniques.\n                            </li>\n                            <li>Troubleshoot issues related to front-end development, and work with the team to resolve\n                                bugs and performance issues.\n                            </li>\n                        </ul>\n                        <br>\n                        <br>\n                        <b>Education:</b>\n                        <p class=\"body-2 font-italic\">\n                            Bachelor's degree in Computer Engineering\n                            <br>\n                            Shahrood University of Technology| Sep 2017 - Jan 2022\n                        </p>"
  }
}